Tekla Open API Reference for Tekla Structures 2025
Drawing.GetSheet Method
 Gets the sheet of the drawing.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ContainerView GetSheet()
Public Function GetSheet As ContainerView
Return Value
Type: ContainerView
The sheet of the drawing.
See Also
Reference
Drawing Class
Tekla.Structures.Drawing Namespace